Repository: AndreXi/organized_camera
Catalog: lib/src/localization/app_*.arb
Languages: es

# homeSelectDirectory
source: Select the directory:
es: Selecciona una carpeta:

# homeAddNewDirectory
source: Add new directory
es: Agrega una carpeta

# homeDirectoryInfo
source: Directory info:
es: Información de la carpeta:

# cameraDirectoryWriteError
source: The selected path has write protection by system, check if the application has directory access permissions or select other directory to save it.
es: El directorio seleccionado esta protegido contra escritura, revisa que la aplicación tenga permisos de escritura en cualquier directorio o selecciona otro.

# cameraOSError
source: OS Error
es: Error SO

# cameraPermissionsError
source: Camera access denied, check app permissions.
es: Imposible acceder a la cámara, revisa los permisos de la aplicación.

# cameraUnknownError
source: Unknown camera error
es: Error desconocido al acceder a la cámara.

# addDirectoryFormSuccess
source: Directory added
es: Directorio agregado

# addDirectoryFormTitle
source: Create a new directory profile
es: Crea un nuevo perfil

# addDirectoryFormProfileNameHint
source: Profile Name
es: Nombre del perfil

# addDirectoryFormProfileNameError
source: The profile name is required
es: El nombre del perfil es requerido

# addDirectoryFormdirectoryHint
source: Directory
es: Directorio

# addDirectoryFormdirectoryError
source: The directory is required
es: El directorio es requerido

# addDirectoryFormSelectDirectory
source: Select directory
es: Selecciona un directorio

# addDirectoryFormCreate
source: Create
es: Crear

# addDirectoryFormCancel
source: Cancel
es: Cancelar

# appInfoDeveloper
source: Developed by @AndreXi
es: Desarrollado por @AndreXi

# appInfoDeveloperName
source: Andres Pereira
es: Andrés Pereira

# directoryInfoEmpty
source: You must select a profile first
es: Debes seleccionar un perfil primero.

# directoryInfoProfileTitle
source: Profile:
es: Perfil:

# directoryInfoDirectoryTitle
source: The photos will be saved in:
es: Las fotos se guardarán en:

# editDirectoryFormSuccess
source: Directory edited
es: Directorio modificado.

# editDirectoryFormTitle
source: Edit a directory profile
es: Modifica un perfil

# editDirectoryFormProfileNameHint
source: Profile Name
es: Nombre del perfil

# editDirectoryFormProfileNameError
source: The profile name is required
es: El nombre del perfil es requerido

# editDirectoryFormdirectoryHint
source: Directory
es: Directorio

# editDirectoryFormdirectoryError
source: The directory is required
es: El directorio es requerido

# editDirectoryFormSelectDirectory
source: Select directory
es: Selecciona un directorio

# editDirectoryFormCreate
source: Create
es: Crear

# editDirectoryFormCancel
source: Cancel
es: Cancelar

# openCameraPermissionsRequestDenied
source: Permissions denied by user
es: Permisos negados por el usuario

# openCameraPermissionsRequestDeniedPermanently
source: Permission denied permanently, change this in settings
es: Permisos negados permanentemente, revisa la configuración de permisos en configuración.

# openCameraPermissionDialogTitle
source: Permissions nedded
es: Permisos necesarios

# openCameraPermissionDialogExplanation
source: We need to ask your permission to be able to read / write in all directories, so we can save your photos in your selected directory.
es: Esta aplicación necesita permisos de lectura / escritura en cualquier directorio de esa forma las fotos tomadas se guardaran en el directorio seleccionado.

# savedDirectoryTileActionsEdit
source: Edit
es: Editar

# savedDirectoryTileActionsDelete
source: Delete
es: Eliminar
